/**
* Указываем, в каком пакете находится тест.
*/
package forms;
/**
* Импортируем все классы из пакета для проверки тестовой логики, 
* проверки результатов расчета
*/
import static org.junit.Assert.*;
/**
 * Импортируем все классы из пакета проведения для тестирования
 */
import org.junit.*;
/**
* Создаем класс для тестирования расчета итоговой суммы квартплаты
*/
public class Testing_Accountant_Paid {
/**
* Инициализируем экземпляр класса для тестирования
*/
public Accountant_Panel accountant_panel;
/**
* Аннотация, указывающая на метод, который будет выполняться перед каждым
* запуском теста
*/
@Before
/**
* Создаем метод, который будет выполняться перед каждым запуском теста;
* в нем устанавливаем входные параметры для тестирования.
*/
public void testinit() {
/**
* Создаем новый экземпляр класса для его тестирования 
*/
accountant_panel = new Accountant_Panel();
/**
* Присваиваем радиокнопке "квартира" значение "истина" 
* (выбран тип жилья "квартира")
*/
accountant_panel.radiobuttons[0].setSelected(true);
/**
* Присваиваем текстовому полю "площадь квартиры" значение 43.7
*/
accountant_panel.accountant_textfields[0].setText("43.7");
/**
* Присваиваем текстовому полю "расход горячей воды" значение 5
*/
accountant_panel.accountant_textfields[1].setText("5");
/**
* Присваиваем текстовому полю "расход холодной воды" значение 5
*/
accountant_panel.accountant_textfields[2].setText("5");
/**
* Присваиваем текстовому полю "расход электроэнергии" значение 110 
*/
accountant_panel.accountant_textfields[3].setText("110");
/**
* Присваиваем текстовому полю "расход газа" значение 8.5 
*/
accountant_panel.accountant_textfields[4].setText("8.5");
/**
* Присваиваем текстовому полю "уборка в подъезде" значение 100 
*/
accountant_panel.accountant_textfields[6].setText("100");
/**
* Присваиваем текстовому полю "освещение в подъезде" значение 50 
*/
accountant_panel.accountant_textfields[7].setText("50");
/**
* Присваиваем текстовому полю  "уборка улиц" значение 100 
*/
accountant_panel.accountant_textfields[8].setText("100");
/**
* Присваиваем текстовому полю "капитальный ремонт" значение 200 
*/
accountant_panel.accountant_textfields[9].setText("200");
}
/**
* Аннотация, указывающая на то, что за ней следует тестируемый метод.
*/
@Test
/**
* Объявляем метод, который будем тестировать, а именно
* расчет итоговой суммы квартплаты
*/
public void test() {
/**
* Производим расчет итоговой суммы квартплаты, путем
* активации кнопки "Расчет" на пользовательской панели 
*/
accountant_panel.buttons[1].doClick();
/**
* Присваиваем переменной значение 3262.34
* (верный/ожидаемый результат расчета итоговой суммы 
* квартплаты = 3262.34 руб.)
*/
Double summary_expected = 3262.34;
/**
* Присваиваем переменной значение текстового поля "Итог"
* (реально получившийся результат в ходе прохождения теста)
*/
Double summary_actual = Double.valueOf(accountant_panel.accountant_textfields[5].getText());
/**
* Сравниваем значения верного (ожидаемого) результата 
* и реально получившегося результата;
* если результаты равны, тест проходит успешно.
*/
assertEquals(summary_expected,summary_actual);
}
/**
* Аннотация, указывающая на метод, который будет выполняться после каждого
* прохождения теста.
*/
@After
/**
* Создаем метод, который будет выполняться после каждого прохождения теста
*/
public void teststop(){
/**
* Обнуляем переменную после завершения теста
*/
accountant_panel = null;
}
}