/**
* Указываем, в каком пакете находится тест.
*/
package forms;
/**
* Импортируем все классы из пакета для проверки тестовой логики, 
* проверки результатов расчета
*/
import static org.junit.Assert.*;
/**
 * Импортируем все классы из пакета проведения для тестирования
 */
import org.junit.*;
/**
* Создаем класс для тестирования расчета 
* коммунальных услуг
*/
public class Testing_User_Paid {
/**
* Инициализируем экземпляр класса для тестирования
*/
public User_Panel user_panel;
/**
* Аннотация, указывающая на метод, который будет выполняться перед каждым
* запуском теста
*/
@Before
/**
* Создаем метод, который будет выполняться перед каждым запуском теста;
* в нем устанавливаем входные параметры для тестирования.
*/
public void testinit() {
/**
* Создаем новый экземпляр класса для его тестирования
*/
user_panel = new User_Panel();
/**
* Присваиваем радиокнопке "квартира" значение "истина" 
* (выбран тип жилья "квартира")
*/
user_panel.radiobuttons[0].setSelected(true);
/**
* Присваиваем текстовому полю "площадь квартиры" значение 43.7
* 
*/
user_panel.user_textfields[0].setText("43.7");
/**
* Присваиваем текстовому полю "расход горячей воды" значение 5
*/
user_panel.user_textfields[1].setText("5");
/**
* Присваиваем текстовому полю "расход холодной воды" значение 5 
*/
user_panel.user_textfields[2].setText("5");
/**
* Присваиваем текстовому полю "расход электроэнергии" значение 110 
*/
user_panel.user_textfields[3].setText("110");
/**
* Присваиваем текстовому полю "расход газа" значение 8.5 
*/
user_panel.user_textfields[4].setText("8.5");
}
/**
* Аннотация, указывающая на то, что за ней следует тестируемый метод.
*/
@Test
/**
* Объявляем метод, который будем тестировать, а именно
* расчет стоимости коммунальных услуг.
*/
public void test_user() {
/**
* Производим расчет коммунальных услуг, путем
* активации кнопки "Расчет" на пользовательской панели 
*/
user_panel.buttons[1].doClick();
/**
* Присваиваем переменной значение 2812.34
* (верный/ожидаемый результат расчета коммунальных услуг = 2812.34 руб.)
*/
Double summary_expected = 2812.34;
/**
* Присваиваем переменной значение текстового поля "Итог"
* (реально получившийся результат в ходе прохождения теста)
*/
Double summary_actual = Double.valueOf(user_panel.user_textfields[5].getText());
/**
* Сравниваем значения верного (ожидаемого) результата 
* и реально получившегося результата;
* если результаты равны, тест проходит успешно.
*/
assertEquals(summary_expected,summary_actual);
}
/**
* Аннотация, указывающая на метод, который будет выполняться после каждого
* прохождения теста.
*/
@After
/**
* Создаем метод, который будет выполняться после каждого прохождения теста
*/
public void teststop(){
/**
* Обнуляем переменную после завершения теста
*/
user_panel = null;
}
}
